Autodialer/app/views/dashboard/index.html.erb


    fetch('/ai_commands/process_text_command', {
      method: 'POST',
      headers: {
        'Content-Type': 'application/json',
        'X-CSRF-Token': document.querySelector('[name="csrf-token"]').content
      },
      body: JSON.stringify({ command: command })
    })
    .then(response => response.json())
    .then(data => {
      if (data.success) {
        showAiResponse(data.response, 'success');
        input.value = '';

        // Refresh page if it was a system command
        if (['start_calling', 'show_logs', 'show_statistics'].includes(data.action)) {
          setTimeout(() => window.location.reload(), 2000);
        }
      } else {
        showAiResponse('Sorry, I encountered an error processing your command.', 'error');
      }
---
SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."created_at" BETWEEN ? AND ?  [["created_at", "2025-11-09 18:30:00"], ["created_at", "2025-11-10 18:29:59.999999"]]