Autodialer/app/models/phone_number.rb

UPDATE "phone_numbers" SET "formatted_number" = ? WHERE "phone_numbers"."id" = ?  [["formatted_number", "+91 98765 43210"], ["id", 1]]
---
  def set_formatted_number
    self.update_column(:formatted_number, self.class.format_indian_number(number))