Autodialer/app/models/system_setting.rb

  def self.[](key)
    setting = find_by(key: key.to_s)
    return nil unless setting

    case setting.data_type
    when 'integer'
      setting.value.to_i
---
SELECT "system_settings".* FROM "system_settings" WHERE "system_settings"."key" = ? LIMIT ?  [["key", "simulation_mode"], ["LIMIT", 1]]