Autodialer/app/controllers/call_logs_controller.rb

SELECT SUM("call_logs"."duration_seconds") FROM "call_logs" LEFT OUTER JOIN "phone_numbers" ON "phone_numbers"."id" = "call_logs"."phone_number_id" WHERE "call_logs"."created_at" BETWEEN ? AND ?  [["created_at", "2025-11-09 18:30:00"], ["created_at", "2025-11-10 18:29:59.999999"]]
---
  def today
    @call_logs = CallLog.today.includes(:phone_number).recent
    @stats = {
      total: @call_logs.count,
      completed: @call_logs.completed.count,
      failed: @call_logs.failed.count,
      in_progress: @call_logs.in_progress.count,
      total_duration: @call_logs.sum(:duration_seconds),
      total_cost: @call_logs.sum(:cost)

SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."created_at" BETWEEN ? AND ? AND "call_logs"."status" IN (?, ?, ?)  [["created_at", "2025-11-09 18:30:00"], ["created_at", "2025-11-10 18:29:59.999999"], ["status", "queued"], ["status", "ringing"], ["status", "in-progress"]]
---
  def statistics
    @stats = {
      overview: overview_stats,
      by_status: CallLog.group(:status).count,
      by_hour: hourly_stats,
      by_day: daily_stats,
      duration_stats: duration_stats,
      cost_stats: cost_stats