Autodialer/app/controllers/dashboard_controller.rb

  def index
    @stats = calculate_statistics
    @recent_calls = CallLog.recent.includes(:phone_number).limit(10)
    @phone_numbers = PhoneNumber.recent.limit(10)
    @ai_commands = AiCommand.recent.limit(5)

    # Real-time data for dashboard updates
    @pending_calls = PhoneNumber.pending.count
    @active_calls = CallLog.in_progress.count
    @today_calls = CallLog.today.count
---
SELECT "call_logs".* FROM "call_logs" ORDER BY "call_logs"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
SELECT "ai_commands".* FROM "ai_commands" ORDER BY "ai_commands"."created_at" DESC LIMIT ?  [["LIMIT", 5]]
SELECT "phone_numbers".* FROM "phone_numbers" ORDER BY "phone_numbers"."created_at" DESC LIMIT ?  [["LIMIT", 5]]
SELECT COUNT(*) FROM "phone_numbers"
SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."created_at" BETWEEN ? AND ?  [["created_at", "2025-11-09 18:30:00"], ["created_at", "2025-11-10 18:29:59.999999"]]

  def calculate_statistics
    {
      total_numbers: PhoneNumber.count,
      pending_numbers: PhoneNumber.pending.count,
      completed_numbers: PhoneNumber.completed.count,
      failed_numbers: PhoneNumber.failed.count,
      total_calls: CallLog.count,
      successful_calls: CallLog.completed.count,
      failed_calls: CallLog.failed.count,
      active_calls: CallLog.in_progress.count,
      today_calls: CallLog.today.count,
      today_successful: CallLog.today.completed.count,
      today_failed: CallLog.today.failed.count,
      success_rate: success_rate,
      total_duration: CallLog.sum(:duration_seconds),
      total_cost: CallLog.sum(:cost)
---
SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."created_at" BETWEEN ? AND ?  [["created_at", "2025-11-09 18:30:00"], ["created_at", "2025-11-10 18:29:59.999999"]]
SELECT COUNT(*) FROM "phone_numbers"

  def success_rate
    total = CallLog.count
---
SELECT COUNT(*) FROM "call_logs"